"""
1) написати прогу, яка вибирає зі введеної строки цифри і виводить їх через кому,
#
# наприклад:
#
# st = ‘as 23 fdfdg544’ введена строка
#
# 2,3,5,4,4        #вивело в консолі.
"""


###########################################################
string_1 = 'qwe1213sa3 sffr3Mkkk#ff fj11'
list_1 = [i for i in string_1 if i.isdigit() == True]
print(','.join(list_1))
###########################################################
"""
2)написати прогу, яка вибирає зі введеної строки числа і виводить їх так, як вони написані

наприклад:

  st = ‘as 23 fdfdg544 34’ #введена строка

  23, 544, 34              #вивело в консолі

"""
###########################################################
