"""
1) написати прогу, яка вибирає зі введеної строки цифри і виводить їх через кому,
#
# наприклад:
#
# st = ‘as 23 fdfdg544’ введена строка
#
# 2,3,5,4,4        #вивело в консолі.
"""


###########################################################
st = 'as 12 fsad124 4124dsf 1234f'
result =[j for j in st if j.isdigit()]
print(', '.join(result))
###########################################################
"""
2)написати прогу, яка вибирає зі введеної строки числа і виводить їх так, як вони написані

наприклад:

  st = ‘as 23 fdfdg544 34’ #введена строка

  23, 544, 34              #вивело в консолі

"""
###########################################################
